base_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	 (0 0 0)
	 (0 0.999390827019096 0.03489949670250)
	 (0 0.999390827019096 -0.03489949670250)
	 (1 0 0)
	 (1 0.999390827019096 0.03489949670250)
	 (1 0.999390827019096 -0.03489949670250)
	 (2 0 0)
	 (2 0.999390827019096 0.03489949670250)
	 (2 0.999390827019096 -0.03489949670250)
	 (3 0 0)
	 (3 0.999390827019096 0.03489949670250)
	 (3 0.999390827019096 -0.03489949670250)
	 (1 1.998781654038192 0.069798993405002)
	 (1 1.998781654038192 -0.069798993405002)
	 (2 1.998781654038192 0.069798993405002)
	 (2 1.998781654038192 -0.069798993405002)
);

blocks
(
     hex (0 3 5 2 0 3 4 1) (5 5 1) simpleGrading (1 1 1)
     hex (3 6 8 5 3 6 7 4) (5 5 1) simpleGrading (1 1 1)
     hex (6 9 11 8 6 9 10 7) (5 5 1) simpleGrading (1 1 1)
     hex (5 8 15 13 4 7 14 12) (5 5 1) simpleGrading (1 1 1)



);

edges
(
	 arc 1 2 (0 1 0)
	 arc 4 5 (1 1 0)
	 arc 7 8 (2 1 0)
	 arc 10 11 (3 1 0)
	 arc 12 13 (1 2 0)
	 arc 14 15 (2 2 0)
);

boundary
(
	 inlet
	{
		 type patch;
		 faces
		(
			 (0 1 2 0)
		 );
	}
	 outlet
	{
		 type patch;
		 faces
		 (
			 (9 11 10 9)
		 );
	}
	 top
	{
		 type wall;
		 faces
		 (
			 (1 4 5 2)
			 (4 12 13 5)
			 (12 14 15 13)
			 (7 8 15 14)
			 (7 10 11 8)
		 );
	}
	 back
	{
		 type wedge;
		 faces
		 (
			 (0 2 5 3)
			 (3 5 8 6)
			 (6 8 11 9)
			 (5 13 15 8)
		 );
	}
	 front
	{
		 type wedge;
		 faces
		 (
			 (0 3 4 1)
			 (3 6 7 4)
			 (6 9 10 7)
			 (4 7 14 12)
		 );
	}
	 axis
	{
		 type empty;
		 faces
		 (
			 (0 3 3 0)
			 (3 6 6 3)
			 (6 9 9 6)
		 );
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
